Revit 2024 API
ElementPhaseStatusFilter.PhaseId Property
 The phase id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ElementId PhaseId { get; }
Visual Basic
Public ReadOnly Property PhaseId As ElementId
	Get
Visual C++
public:
property ElementId^ PhaseId {
	ElementId^ get ();
}
See Also
ElementPhaseStatusFilter Class
Autodesk.Revit.DB Namespace